using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Zborche
{
    public class DataHolder
    {
        public HashSet<string> wordsSet =
        [
            //A
            "амбар", "ангел", "арена", "атлас", "актер", "анекс",
            "аграр", "акорд", "афект", "архив", "алиби", "амбис",
            "арома", "атоми", "аванс", "афион", "албум", "атлет",
            "ајдук", "афера", "амеба", "автор", "акрил", "авион",
            "астма", "анали", "аудио",
            //Б
            "башка", "башак", "бабин", "багаж", "базен", "бакар",
            "балет", "банка", "банки", "баран", "брада", "барем",
            "барка", "басен", "бегал", "бегам", "безел", "билка",
            "берба", "берач", "бесач", "бесен", "бесни", "бетон",
            "бибер", "бизон", "бедни", "биено", "биење", "билен",
            "бинго", "бисер", "биста", "битен", "битие", "битка",
            "бишка", "бишки", "балон", "буква",
            //В
            "вагон", "важен", "вазна", "вакум", "валка", "варда",
            "варен", "варка", "вафла", "ведар", "ведне", "ведра",
            "ведро", "вејка", "вежба", "вежен", "векна", "венци",
            "весел", "вести", "восок", "веста", "ветар", "ветка",
            "ветра", "ветре", "вечер", "вечна", "вечно", "вешта",
            "виден", "видна", "везир", "визир",
            //Г
            "габар", "габер", "габри", "гајба", "гајда", "гајди",
            "гајка", "гакне", "гален", "глава", "галон", "гарда",
            "гасен", "гасне", "гасни", "гениј", "гајле",
            //Д
            "данок", "датум", "давен", "далек", "дамка", "дамна",
            "даска", "дабар", "дебел", "девер", "дејка", "декан",
            "делач", "делба", "делка", "делов", "делта", "десен",
            "десно", "десет", "детаљ", "дечко", "демек", "демон",
            "денар", "диван",
            //Ѓ
            "ѓавол", "ѓакон", "ѓезве",
            //Е
            "елмаз", "еднаш", "езеро", "еснаф", "ербап", "ерген",
            "елече", "елени",
            //Ж
            "жежок", "жежне", "жедна", "желба", "жезол", "желад",
            "желен", "жеден", "жедно", "желка", "женка", "женки",
            "жилет", "жубор", "жален", "жолта", "жолто", "жолти",
            //З
            "завод", "залог", "затка", "замав", "замок", "земја",
            "заеми", "забар", "зграби", "здрада", "згради", "забец",
            "забае", "зошто", "зашто", "зелка",
            //Ѕ
            "ѕидар", "ѕиден", "ѕирка",
            //И
            "играч", "извоз", "ивица", "избор", "извод",
            //Ј
            "јајце", "јајца", "јавор", "јаден", "јадна", "јазол",
            //К
            "канџа", "кавал", "каиши", "кабел", "кабле", "кавга",
            "кафез", "кугла", "кадар", "казан", "казна", "капут",
            "камин", "камен", "канал", "карат", "круто", "карпа",
            "карта", "круша", "коска", "касна", "кафен", "коцка",
            "коцки", "колар", "кочии", "книга",
            //Л
            "ладен", "ладна", "ладно", "лажен", "лажна", "лажно",
            "лакто", "лепак", "лажго", "лапач", "лижач", "лимар",
            "лекар", "ликра", "ликер", "лакер",
            //Љ

            //М
            "мачка", "мачор", "мачен", "мечка", "мечок", "магла",
            "магма", "мадем", "мадро", "модро", "модар", "мајка",
            "мамка", "макар", "макро", "мамут", "манго", "мрава",
            "маска", "масло", "масна", "матка", "масна", "маќеа",
            "меден", "мента", "магла", "маста", "мисла", "мудар",
            "медар", "модар", "медал", "метал", "матен", "матно",
            "матна", "мокар", "мокра", "мокро", "место", "маска",
            "млака", "млако", "млеко", "мидер", "малер", "молер",
            "молец", "мелем", "мелен", "мелез", "мелос", "мозок",
            "молив",
            //Н
            "нагон", "набор", "напор", "непар", "налик", "ништо",
            "никој", "некој", "нотес", "надеж", "назад", "нигде",
            "негде", "накит", "нокти", "ноќен", "ноќта", "нурна",
            "напад", "нимфа", "нунка", "нунко",
            //Њ

            //О
            "обред", "облог", "облак", "однос", "отров", "отказ",
            "очила", "олуци", "обиди", "обара", "обата", "обаца",
            "обари", "обави", "одбор", "оглед", "одмор", "одмет",
            "отпад",
            //П
            "пајка", "патор", "патка", "палма", "палка", "палат",
            "пакет", "папок", "пајак", "погон", "пегла", "печат",
            "поток", "порок", "плети", "перка", "перчи", "палто",
            "панда", "палта", "плаќа", "памук", "памет", "перон",
            "папка", "писмо", "паста", "пасус", "пасош", "пасне",
            "пасаж", "пасив", "патче", "плачи", "плаче", "петел",
            //Р
            "работ", "радар", "редар", "реков", "рекол", "рамка",
            "расте", "расти", "рачка", "речна", "ребра", "ребро",
            "регал", "рекет",
            //С
            "стаза", "слава", "сваќа", "сфаќа", "става", "столе",
            "семка", "седло", "седум", "седмо", "секта", "сутне",
            "сигма", "слика", "смока", "смоки", "смети", "смеса",
            "смета", "ситен", "ситце", "ситар", "ситни", "ситно",
            "стази", "скока", "скија", "свето", "свари", "свежо",
            "свежа", "стока", "ситен", "ситно", "санка", "слуша",
            "сапун", "сонце", "сенка", "слама", "слана", "свеќа",
            "среќа",
            //Т
            "тањир", "темен", "табак", "таван", "таман", "тајна",
            "талас", "танго", "тапет", "торка", "топка", "тесто",
            "ташна", "ташак", "татко", "торта", "тиган", "тираг",
            "точка", "тапет", "тутун", "торба", "тажен", "топка",
            "тиква", "таква", "тивка",
            //Ќ
            "ќотек", "ќофте", "ќерка", "ќебап",
            //У
            "убаво", "убави", "углед", "удари",
            //Ф
            "фиока", "фарба", "факел", "фарби", "фазан", "фазон", 
            "фарма",
            //Х
            "хекла", 
            //Ц
            "цевка", "цреша", "циста", "цигла", "цуцла", "циган", 
            "цвета", "цеден",
            //Ч
            "чешел", "чамец", "чадор", "чувар", "чуван", "чуден", 
            "чисто", "чашка", "чушка", "чевел", "чевла", "читко", 
            "читач", "часот", "чевли", "чекор",
            //Џ
            "џигер", "џагор", "џитка", "џитне", "џидне", "џилит",
            "џиљве", "џинка", "џинче", "џипче", "џепче",
            //Ш
            "шутка", "шешир", "шатор", "шишка", "шапка", "шарен", 
            "шарка", "шамар", "шеќер", "шепот", "шофер", "шугав",
            "шумар", "штама", "штала", "штека", "шлајм", "штипи",
            "шатка"
        ];

        public DataHolder()
        {}
    }
}
